
* mastodon commands index

#+BEGIN_SRC emacs-lisp :results table :colnames '("Binding" "Command" "Description") :exports results
  (let ((rows))
    (mapatoms
     (lambda (symbol)
       (when (and (string-match "^mastodon"
                                (symbol-name symbol))
                  (commandp symbol))
         (let* ((doc (car
                      (split-string
                       (or (documentation symbol t) "")
                       "\n")))
                ;; add more keymaps here
                ;; some keys are in sub 'keymap keys inside a map
                (maps (list mastodon-mode-map
                            mastodon-toot-mode-map
                            mastodon-profile-mode-map
                            mastodon-notifications--map
                            mastodon-tl--shr-image-map-replacement
                            mastodon-profile-update-mode-map
                            mastodon-views-map
                            mastodon-views--follow-suggestions-map
                            mastodon-views--scheduled-map
                            mastodon-views--view-lists-keymap
                            mastodon-views--view-follow-requests-keymap
                            mastodon-views--view-filters-keymap))
                (binding-code
                 (let ((keys (where-is-internal symbol maps nil nil (command-remapping symbol))))
                   ;; just take first 2 bindings:
                   (if (> (length keys) 2)
                       (list (car keys) (cadr keys))
                     keys)))
                ;; (or (car (rassoc symbol mastodon-mode-map))
                ;; (car (rassoc symbol (cadr mastodon-toot-mode-map)))
                ;; (car (rassoc symbol (cadr mastodon-profile-mode-map)))
                ;; (car (rassoc symbol mastodon-notifications--map))))
                (binding-str (if binding-code
                                 (mapconcat #'help--key-description-fontified
                                            binding-code ", ")
                               "")))
           (push `(,binding-str ,symbol ,doc) rows)
           rows))))
    (sort rows (lambda (x y) (string-lessp (cadr x) (cadr y)))))
#+END_SRC

#+RESULTS:
| Binding          | Command                                           | Description                                                                    |
|------------------+---------------------------------------------------+--------------------------------------------------------------------------------|
|                  | mastodon                                          | Connect Mastodon client to `mastodon-instance-url' instance.                   |
|                  | mastodon-async-mode                               | Async Mastodon.                                                                |
|                  | mastodon-discover                                 | Plug Mastodon functionality into `discover'.                                   |
| C-M-q            | mastodon-kill-all-buffers                         | Kill any and all open mastodon buffers, hopefully.                             |
|                  | mastodon-mode                                     | Major mode for Mastodon, the federated microblogging network.                  |
|                  | mastodon-notifications--clear-all                 | Clear all notifications.                                                       |
| C-k              | mastodon-notifications--clear-current             | Dismiss the notification at point.                                             |
|                  | mastodon-notifications--follow-request-accept     | Accept a follow request.                                                       |
| j                | mastodon-notifications--follow-request-reject     | Reject a follow request.                                                       |
|                  | mastodon-notifications--get-boosts                | Display boost notifications in buffer.                                         |
|                  | mastodon-notifications--get-favourites            | Display favourite notifications in buffer.                                     |
| @                | mastodon-notifications--get-mentions              | Display mention notifications in buffer.                                       |
|                  | mastodon-notifications--get-polls                 | Display poll notifications in buffer.                                          |
|                  | mastodon-notifications--get-statuses              | Display status notifications in buffer.                                        |
| N                | mastodon-notifications-get                        | Display NOTIFICATIONS in buffer.                                               |
|                  | mastodon-profile--account-bot-toggle              | Toggle the bot status of your account.                                         |
|                  | mastodon-profile--account-discoverable-toggle     | Toggle the discoverable status of your account.                                |
|                  | mastodon-profile--account-locked-toggle           | Toggle the locked status of your account.                                      |
|                  | mastodon-profile--account-search                  | Run a statuses search QUERY for the currently viewed account.                  |
|                  | mastodon-profile--account-sensitive-toggle        | Toggle the sensitive status of your account.                                   |
|                  | mastodon-profile--account-view-cycle              | Cycle through profile view: toots, toot sans boosts, followers, and following. |
|                  | mastodon-profile--add-account-to-list             | Add account of current profile buffer to a list.                               |
|                  | mastodon-profile--add-private-note-to-account     | Add a private note to an account.                                              |
| A                | mastodon-profile--get-toot-author                 | Open profile of author of toot under point.                                    |
| O                | mastodon-profile--my-profile                      | Show the profile of the currently signed in user.                              |
|                  | mastodon-profile--open-followers                  | Open a profile buffer showing the accounts following the current profile.      |
|                  | mastodon-profile--open-following                  | Open a profile buffer showing the accounts that current profile follows.       |
|                  | mastodon-profile--open-statuses-no-reblogs        | Open a profile buffer showing statuses without reblogs.                        |
|                  | mastodon-profile--remove-from-followers-at-point  | Prompt for a user in the item at point and remove from followers.              |
|                  | mastodon-profile--remove-from-followers-list      | Select a user from your followers and remove from followers.                   |
|                  | mastodon-profile--remove-user-from-followers      | Remove a user from your followers.                                             |
|                  | mastodon-profile--show-familiar-followers         | Show a list of familiar followers.                                             |
| P                | mastodon-profile--show-user                       | Query for USER-HANDLE from current status and show that user's profile.        |
|                  | mastodon-profile--toot-json                       | Get the next toot-json.                                                        |
|                  | mastodon-profile--update-display-name             | Update display name for your account.                                          |
|                  | mastodon-profile--update-meta-fields              | Prompt for new metadata fields information and PATCH the server.               |
|                  | mastodon-profile--update-profile-note-cancel      | Cancel updating user profile and kill buffer and window.                       |
| U                | mastodon-profile--update-user-profile-note        | Fetch user's profile note and display for editing.                             |
|                  | mastodon-profile--user-profile-send-updated       | Send PATCH request with the updated profile note.                              |
|                  | mastodon-profile--view-account-private-note       | Display the private note about a user.                                         |
| K                | mastodon-profile--view-bookmarks                  | Open a new buffer displaying the user's bookmarks.                             |
| V                | mastodon-profile--view-favourites                 | Open a new buffer displaying the user's favourites.                            |
|                  | mastodon-profile--view-preferences                | View user preferences in another window.                                       |
|                  | mastodon-profile-mode                             | Toggle mastodon profile minor mode.                                            |
|                  | mastodon-profile-update-mode                      | Minor mode to update Mastodon user profile.                                    |
|                  | mastodon-search--query-cycle                      | Cycle through search types: accounts, hashtags, and statuses.                  |
| s                | mastodon-search--query                     | Prompt for a search QUERY and return accounts, statuses, and hashtags.         |
|                  | mastodon-search--trending-statuses                | Display a list of statuses trending on your instance.                          |
|                  | mastodon-search--trending-tags                    | Display a list of tags trending on your instance.                              |
|                  | mastodon-search-mode                              | Toggle mastodon search minor mode.                                             |
|                  | mastodon-serach--query-accounts-followed          | Run an accounts search QUERY, limited to your followers.                       |
| B                | mastodon-tl--block-user                           | Query for USER-HANDLE from current status and block that user.                 |
| <mouse-2>        | mastodon-tl--click-image-or-video                 | Click to play video with `mpv.el'.                                             |
|                  | mastodon-tl--disable-notify-user-posts            | Query for USER-HANDLE and disable notifications when they post.                |
| m                | mastodon-tl--dm-user                              | Query for USER-HANDLE from current status and compose a message to that user.  |
|                  | mastodon-tl--do-link-action                       | Do the action of the link at point.                                            |
|                  | mastodon-tl--do-link-action-at-point              | Do the action of the link at POSITION.                                         |
|                  | mastodon-tl--enable-notify-user-posts             | Query for USER-HANDLE and enable notifications when they post.                 |
|                  | mastodon-tl--filter-user-user-posts-by-language   | Query for USER-HANDLE and enable notifications when they post.                 |
|                  | mastodon-tl--follow-tag                           | Prompt for a tag and follow it.                                                |
| W                | mastodon-tl--follow-user                          | Query for USER-HANDLE from current status and follow that user.                |
| '                | mastodon-tl--followed-tags-timeline               | Open a timeline of all your followed tags.                                     |
| F                | mastodon-tl--get-federated-timeline               | Open federated timeline.                                                       |
| H                | mastodon-tl--get-home-timeline                    | Open home timeline.                                                            |
| L                | mastodon-tl--get-local-timeline                   | Open local timeline.                                                           |
| #                | mastodon-tl--get-tag-timeline                     | Prompt for tag and opens its timeline.                                         |
|                  | mastodon-tl--goto-next-item                       | Jump to next item, e.g. filter or follow request.                              |
| C-<down>, n      | mastodon-tl--goto-next-toot                       | Jump to next toot header.                                                      |
|                  | mastodon-tl--goto-prev-item                       | Jump to previous item, e.g. filter or follow request.                          |
| C-<up>, p        | mastodon-tl--goto-prev-toot                       | Jump to last toot header.                                                      |
| "                | mastodon-tl--list-followed-tags                   | List followed tags. View timeline of tag user choses.                          |
| C-<return>       | mastodon-tl--mpv-play-video-at-point              | Play the video or gif at point with an mpv process.                            |
|                  | mastodon-tl--mpv-play-video-from-byline           | Run `mastodon-tl--mpv-play-video-at-point' on first moving image in post.      |
|                  | mastodon-tl--mute-thread                          | Mute the thread displayed in the current buffer.                               |
| M                | mastodon-tl--mute-user                            | Query for USER-HANDLE from current status and mute that user.                  |
| TAB, M-n         | mastodon-tl--next-tab-item                        | Move to the next interesting item.                                             |
| v                | mastodon-tl--poll-vote                            | If there is a poll at point, prompt user for OPTION to vote on it.             |
| S-TAB, <backtab> | mastodon-tl--previous-tab-item                    | Move to the previous interesting item.                                         |
| Z                | mastodon-tl--report-to-mods                       | Report the author of the toot at point to your instance moderators.            |
| SPC              | mastodon-tl--scroll-up-command                    | Call `scroll-up-command', loading more toots if necessary.                     |
|                  | mastodon-tl--single-toot                          | View toot at point in separate buffer.                                         |
|                  | mastodon-tl--some-followed-tags-timeline          | Prompt for some tags, and open a timeline for them.                            |
| T                | mastodon-tl--thread                               | Open thread buffer for toot at point or with ID.                               |
| c                | mastodon-tl--toggle-spoiler-text-in-toot          | Toggle the visibility of the spoiler text in the current toot.                 |
| C-S-b            | mastodon-tl--unblock-user                         | Query for USER-HANDLE from list of blocked users and unblock that user.        |
|                  | mastodon-tl--unfollow-tag                         | Prompt for a followed tag, and unfollow it.                                    |
| C-S-w            | mastodon-tl--unfollow-user                        | Query for USER-HANDLE from current status and unfollow that user.              |
|                  | mastodon-tl--unmute-thread                        | Mute the thread displayed in the current buffer.                               |
| S-RET            | mastodon-tl--unmute-user                          | Query for USER-HANDLE from list of muted users and unmute that user.           |
| u, g             | mastodon-tl--update                               | Update timeline with new toots.                                                |
|                  | mastodon-tl--view-whole-thread                    | From a thread view, view entire thread.                                        |
| t                | mastodon-toot                                     | Update instance with new toot. Content is captured in a new buffer.            |
| C-c C-a          | mastodon-toot--attach-media                       | Prompt for an attachment FILE with DESCRIPTION.                                |
| C-c C-k          | mastodon-toot--cancel                             | Kill new-toot buffer/window. Does not POST content to Mastodon.                |
| C-c C-v          | mastodon-toot--change-visibility                  | Change the current visibility to the next valid value.                         |
| C-c !            | mastodon-toot--clear-all-attachments              | Remove all attachments from a toot draft.                                      |
|                  | mastodon-toot--copy-toot-text                     | Copy text of toot at point.                                                    |
| C                | mastodon-toot--copy-toot-url                      | Copy URL of toot at point.                                                     |
| C-c C-p          | mastodon-toot--create-poll                        | Prompt for new poll options and return as a list.                              |
|                  | mastodon-toot--delete-all-drafts                  | Delete all drafts.                                                             |
| D                | mastodon-toot--delete-and-redraft-toot            | Delete and redraft user's toot at point synchronously.                         |
|                  | mastodon-toot--delete-draft-toot                  | Prompt for a draft toot and delete it.                                         |
| d                | mastodon-toot--delete-toot                        | Delete user's toot at point synchronously.                                     |
|                  | mastodon-toot--download-custom-emoji              | Download `mastodon-instance-url's custom emoji.                                |
| e                | mastodon-toot--edit-toot-at-point                 | Edit the user's toot at point.                                                 |
|                  | mastodon-toot--enable-custom-emoji                | Add `mastodon-instance-url's custom emoji to `emojify'.                        |
| C-c C-e          | mastodon-toot--insert-emoji                       | Prompt to insert an emoji.                                                     |
| .                | mastodon-toot--list-toot-boosters                 | List the boosters of toot at point.                                            |
| ,                | mastodon-toot--list-toot-favouriters              | List the favouriters of toot at point.                                         |
|                  | mastodon-toot--open-draft-toot                    | Prompt for a draft and compose a toot with it.                                 |
| i                | mastodon-toot--pin-toot-toggle                    | Pin or unpin user's toot at point.                                             |
| r                | mastodon-toot--reply                              | Reply to toot at `point'.                                                      |
|                  | mastodon-toot--save-draft                         | Save the current compose toot text as a draft.                                 |
| C-c C-s          | mastodon-toot--schedule-toot                      | Read a date (+ time) in the minibuffer and schedule the current toot.          |
| C-c C-c          | mastodon-toot--send                               | POST contents of new-toot buffer to Mastodon instance and kill buffer.         |
|                  | mastodon-toot--set-default-visibility             | Set the default visibility for toots on the server.                            |
| C-c C-l          | mastodon-toot--set-toot-language                  | Prompt for a language and set `mastodon-toot--language'.                       |
| k                | mastodon-toot--toggle-bookmark                    | Bookmark or unbookmark toot at point.                                          |
| b                | mastodon-toot--toggle-boost                       | Boost/unboost toot at `point'.                                                 |
| f                | mastodon-toot--toggle-favourite                   | Favourite/unfavourite toot at `point'.                                         |
| C-c C-n          | mastodon-toot--toggle-nsfw                        | Toggle `mastodon-toot--content-nsfw'.                                          |
| C-c C-w          | mastodon-toot--toggle-warning                     | Toggle `mastodon-toot--content-warning'.                                       |
| a                | mastodon-toot--translate-toot-text                | Translate text of toot at point.                                               |
| E                | mastodon-toot--view-toot-edits                    | View editing history of the toot at point in a popup buffer.                   |
|                  | mastodon-toot-mode                                | Minor mode to capture Mastodon toots.                                          |
|                  | mastodon-turn-on-discover                         | Turns on discover support                                                      |
|                  | mastodon-url-lookup                               | If a URL resembles a mastodon link, try to load in `mastodon.el'.              |
|                  | mastodon-views--add-account-to-list               | Prompt for a list and for an account, add account to list.                     |
|                  | mastodon-views--add-account-to-list-at-point      | Prompt for account and add to list at point.                                   |
|                  | mastodon-views--add-toot-account-at-point-to-list | Prompt for a list, and add the account of the toot at point to it.             |
|                  | mastodon-views--cancel-scheduled-toot             | Cancel the scheduled toot at point.                                            |
|                  | mastodon-views--copy-scheduled-toot-text          | Copy the text of the scheduled toot at point.                                  |
|                  | mastodon-views--create-filter                     | Create a filter for a word.                                                    |
|                  | mastodon-views--create-list                       | Create a new list.                                                             |
|                  | mastodon-views--delete-filter                     | Delete filter at point.                                                        |
|                  | mastodon-views--delete-list                       | Prompt for a list and delete it.                                               |
|                  | mastodon-views--delete-list-at-point              | Delete list at point.                                                          |
|                  | mastodon-views--edit-list                         | Prompt for a list and edit the name and replies policy.                        |
|                  | mastodon-views--edit-list-at-point                | Edit list at point.                                                            |
|                  | mastodon-views--edit-scheduled-as-new             | Edit scheduled status as new toot.                                             |
|                  | mastodon-views--instance-desc-misskey             | Show instance description for a misskey/firefish server.                       |
|                  | mastodon-views--remove-account-from-list          | Prompt for a list, select an account and remove from list.                     |
|                  | mastodon-views--remove-account-from-list-at-point | Prompt for account and remove from list at point.                              |
|                  | mastodon-views--reschedule-toot                   | Reschedule the scheduled toot at point.                                        |
| I                | mastodon-views--view-filters                      | View the user's filters in a new buffer.                                       |
| R                | mastodon-views--view-follow-requests              | Open a new buffer displaying the user's follow requests.                       |
| G                | mastodon-views--view-follow-suggestions           | Display a buffer of suggested accounts to follow.                              |
| ;                | mastodon-views--view-instance-description         | View the details of the instance the current post's author is on.              |
|                  | mastodon-views--view-instance-description-brief   | View brief details of the instance the current post's author is on.            |
|                  | mastodon-views--view-list-timeline                | Prompt for a list and view its timeline.                                       |
| X                | mastodon-views--view-lists                        | Show the user's lists in a new buffer.                                         |
|                  | mastodon-views--view-own-instance                 | View details of your own instance.                                             |
|                  | mastodon-views--view-own-instance-brief           | View brief details of your own instance.                                       |
| S                | mastodon-views--view-scheduled-toots              | Show the user's scheduled toots in a new buffer.                               |
|                  | mastodon-views--view-timeline-list-at-point       | View timeline of list at point.                                                |

* mastodon custom variables index
 
#+BEGIN_SRC emacs-lisp :results table :colnames '("Custom variable" "Description") :exports results
  (let ((rows))
    (mapatoms
     (lambda (symbol)
       (when (and (string-match "^mastodon"
                                (symbol-name symbol))
                  (custom-variable-p symbol))
         (let* ((doc (car (split-string
                           (or (get (indirect-variable symbol)
                                    'variable-documentation)
                               (get symbol 'variable-documentation)
                               "")
                           "\n"))))
           (push `(,symbol ,doc) rows)
           rows))))
    (sort rows (lambda (x y) (string-lessp (car x) (car y)))))
#+end_src

#+RESULTS:
| Custom variable                                    | Description                                                                  |
|----------------------------------------------------+------------------------------------------------------------------------------|
| mastodon-active-user                               | Username of the active user.                                                 |
| mastodon-client--token-file                        | File path where Mastodon access tokens are stored.                           |
| mastodon-instance-url                              | Base URL for the Mastodon instance you want to be active.                    |
| mastodon-media--avatar-height                      | Height of the user avatar images (if shown).                                 |
| mastodon-media--enable-image-caching               | Whether images should be cached.                                             |
| mastodon-media--preview-max-height                 | Max height of any media attachment preview to be shown in timelines.         |
| mastodon-mode-hook                                 | Hook run when entering Mastodon mode.                                        |
| mastodon-profile-mode-hook                         | Hook run after entering or leaving `mastodon-profile-mode'.                  |
| mastodon-profile-update-mode-hook                  | Hook run after entering or leaving `mastodon-profile-update-mode'.           |
| mastodon-tl--display-caption-not-url-when-no-media | Display an image's caption rather than URL.                                  |
| mastodon-tl--enable-proportional-fonts             | Nonnil to enable using proportional fonts when rendering HTML.               |
| mastodon-tl--enable-relative-timestamps            | Whether to show relative (to the current time) timestamps.                   |
| mastodon-tl--expand-content-warnings               | Whether to expand content warnings by default.                               |
| mastodon-tl--hide-replies                          | Whether to hide replies from the timelines.                                  |
| mastodon-tl--highlight-current-toot                | Whether to highlight the toot at point. Uses `cursor-face' special property. |
| mastodon-tl--show-avatars                          | Whether to enable display of user avatars in timelines.                      |
| mastodon-tl--show-stats                            | Whether to show toot stats (faves, boosts, replies counts).                  |
| mastodon-tl--symbols                               | A set of symbols (and fallback strings) to be used in timeline.              |
| mastodon-tl--timeline-posts-count                  | Number of posts to display when loading a timeline.                          |
| mastodon-tl-position-after-update                  | Defines where `point' should be located after a timeline update.             |
| mastodon-toot--attachment-height                   | Height of the attached images preview in the toot draft buffer.              |
| mastodon-toot--completion-style-for-mentions       | The company completion style to use for mentions.                            |
| mastodon-toot--default-media-directory             | The default directory when prompting for a media file to upload.             |
| mastodon-toot--default-reply-visibility            | Default visibility settings when replying.                                   |
| mastodon-toot--enable-completion                   | Whether to enable completion of mentions and hashtags.                       |
| mastodon-toot--enable-custom-instance-emoji        | Whether to enable your instance's custom emoji by default.                   |
| mastodon-toot--proportional-fonts-compose          | Nonnil to enable using proportional fonts in the compose buffer.             |
| mastodon-toot--use-company-for-completion          | Whether to enable company for completion.                                    |
| mastodon-toot-display-orig-in-reply-buffer         | Display a copy of the toot replied to in the compose buffer.                 |
| mastodon-toot-mode-hook                            | Hook run after entering or leaving `mastodon-toot-mode'.                     |
| mastodon-toot-orig-in-reply-length                 | Length to crop toot replied to in the compose buffer to.                     |
| mastodon-toot-timestamp-format                     | Format to use for timestamps.                                                |
